[
  "با توجه به انتشار نسخه‌های جعلی همراه بانک و اینترنت بانک توسط کلاهبرداران، اکید‌ا توصیه می‌شود برای دانلود یا استفاده از این خدمات، به هیچ عنوان از موتورهای جستجو استفاده نکنید. تنها از طریق وب‌سایت رسمی بانک خود، اقدام به دریافت برنامه‌ها و خدمات بانکی نمایید.",
  "نرم‌افزارهای بانکی که از طریق شبکه‌های اجتماعی، پیام‌رسان‌ها، سایت‌های نامعتبر، بلوتوث، فروشگاه‌های غیررسمی و... منتشر می‌شوند، قابل اعتماد نیستند. لطفا تنها از وب‌سایت رسمی بانک خود نسبت به دانلود نسخه اصلی نرم‌افزارها اقدام کنید و از نصب برنامه‌های ناشناس خودداری نمایید.",
  "هنگام دریافت پیامک، به دقت به نگارش و املای متن توجه کنید. پیامک‌های فیشینگ معمولا دارای غلط‌های املایی هستند که می تواند نشانه ای از جعلی بودن آن‌ها باشد.",
  "هنگام انتقال رمزارز، قبل از تایید و نهایی شدن انتقال، حتما آدرس کیف پول (والت) مقصد را مجددا بررسی کنید. برخی بدافزارها یا افزونه‌های مرورگر ممکن است آدرس کیف پول را در کلیپ‌بورد تغییر دهند و رمزارز به والت کلاهبردارها منتقل شود. برای جلوگیری از این اتفاق، آدرس مقصد را قبل از تأیید تراکنش، تطبیق دهید.",
  "از کلیک کردن روی لینک‌های مشکوک در پیامک‌ها خودداری کنید. این لینک‌ها ممکن است شما را به سایت‌های فیشینگ هدایت کرده و اطلاعات حساس شما را به سرقت ببرند.",
  "به سیستم‌های سرمایه گذاری که وعده سودهای غیرواقعی و غیرمنطقی می دهند، اعتماد نکنید. بسیاری از این طرح‌ها، مانند طرح‌های پانزی، حتی اگر توسط افراد مشهور یا اینفلوئنسرها تبلیغ شوند، در واقع کلاهبرداری هستند.",
  "در هنگام خرید و استفاده از دستگاه کارت خوان، رمز کارت بانکی را شخصا و بدون دخالت دیگران وارد کنید. هرگز رمز خود را به فروشنده یا افراد دیگر نسپارید. توجه داشته باشید که کلاهبرداران ممکن است با استفاده از دستگاه‌های کپی کارت (اسکیمر) اطلاعات کارت شما را سرقت کرده و موجودی حساب‌تان را سرقت کنند.",
  "برای نصب اپلیکیشن‌های موبایل بانک، هرگز از جستجو در موتورهای جستجو (مانند گوگل) استفاده نکنید. مجرمان سایبری با ایجاد سایت‌های جعلی، شما را به صفحات فیشینگ هدایت می کنند که می تواند منجر به سرقت اطلاعات حساس شما شود. همیشه فقط از وب سایت رسمی بانک، لینک نصب را دریافت کنید.",
  "اطلاعات کارت بانکی خود را تنها در درگاه‌های پرداخت رسمی وارد کنید. از وارد کردن اطلاعات کارت در سایت‌ها یا اپلیکیشن‌های مشکوک و غیرمعتبر خودداری نمایید.",
  "داشتن https به تنهایی دلیلی بر معتبر بودن سایت نیست. ممکن است سایت‌های جعلی هم از این پروتکل استفاده کنند.",
  "احراز هویت دو مرحله‌ای (2FA) را برای حساب‌های مهم خود، مانند ایمیل و شبکه‌های اجتماعی، فعال کنید. این قابلیت با درخواست یک کد اضافه (که معمولا از طریق پیامک یا اپلیکیشن‌های احراز هویت دریافت می‌شود) پس از وارد کردن رمز عبور، یک لایه امنیتی بیشتر فراهم می‌کند. با فعال‌سازی این ویژگی، حتی در صورت افشای رمز عبور، از دسترسی غیرمجاز به حساب‌های شما جلوگیری می‌شود.",
  "کلمات بازیابی (Recovery Phrase) یا عبارات امنیتی کیف پول‌های رمزارز، کلید دسترسی به دارایی‌های دیجیتال شما هستند. این کلمات را هرگز در اختیار دیگران قرار ندهید و آن‌ها را در مکان‌های ناامن، مانند فضای ابری یا گوشی متصل به اینترنت، ذخیره نکنید. بهترین روش، نگهداری فیزیکی این کلمات در مکانی مطمئن و امن است. افشای این کلمات به هر نحوی، مساوی با از دست دادن کامل دارایی‌های شما خواهد بود.",
  "هنگام دریافت ایمیل، حتما آدرس ایمیل فرستنده را با دقت بررسی کنید. ممکن است نام فرستنده معتبر به نظر برسد، اما آدرس ایمیل واقعی جعلی یا مشابه آدرس‌های اصلی باشد (مانند تغییر یک حرف یا افزودن یک کاراکتر). همیشه مطمئن شوید که آدرس ایمیل با هویت ادعایی فرستنده همخوانی دارد و از دامنه‌های رسمی استفاده شده است.",
  "در صورت دریافت تماس تلفنی از شماره‌های ناشناس یا پیامک‌هایی با وعده هدیه، برنده شدن در قرعه‌کشی جشنواره‌ها و مسابقات رادیویی یا تلویزیونی، هوشیار باشید. به این پیام‌ها یا تماس‌ها پاسخ ندهید، اطلاعات شخصی ارائه نکنید و روی هیچ لینکی کلیک نکنید. این پیام‌ها معمولا با هدف کلاهبرداری ارسال می‌شوند.",
  "مراقب تماس‌های تلفنی از شماره‌های ناشناس باشید، زیرا ممکن است با هدف سرقت اطلاعات شخصی یا مالی شما انجام شده باشند. هرگز اطلاعات حساس، مانند شماره کارت بانکی، رمز پویا، کد فعال‌سازی دریافت شده از طریق پیامک یا کلمات امنیتی خود را از طریق تلفن در اختیار افراد ناشناس قرار ندهید.",
  "مراقب ایمیل‌ها و پیامک‌هایی باشید که با ایجاد حس اضطرار یا ترس، شما را به اقدام سریع تشویق می‌کنند. حملات فیشینگ اغلب با پیام‌هایی مانند «حساب شما مسدود شد» یا «شکواییه علیه شما» سعی در فریب شما دارند. قبل از هر اقدامی، صحت پیام را از طریق منابع رسمی بررسی کنید.",
  "فایل‌های پیوست ایمیل‌های ناشناس ممکن است حاوی بدافزار، ویروس یا برنامه‌های مخرب باشند که می‌توانند دستگاه شما را آلوده کرده و اطلاعات‌تان را به سرقت ببرند. هرگز فایل‌های پیوستی را که فرستنده یا محتوای آن برایتان ناشناس یا غیرمنتظره است، باز نکنید.",
  "در صورت دریافت پیامک یا پیامی که شامل لینک و درخواست واریز وجه یا ارائه اطلاعات شخصی است، به هیچ عنوان روی لینک‌ها کلیک نکنید و اطلاعات خود را ارسال نکنید. این پیام‌ها می‌توانند فیشینگ یا کلاهبرداری باشند.",
  "برنامه‌های مورد نیاز خود را فقط از مارکت‌های معتبر مانند گوگل‌پلی و... دانلود و نصب کنید. از دریافت و نصب برنامه‌ها از طریق پیام‌رسان‌ها، شبکه‌های اجتماعی، سایت‌های نامعتبر یا لینک‌های ارسال‌شده در پیامک‌ها خودداری کنید، زیرا ممکن است حاوی بدافزار یا نرم‌افزارهای مخرب باشند.",
  "پیش از نصب یا هنگام استفاده از هر برنامه، دسترسی‌های درخواستی آن را با دقت بررسی کنید. اگر یک اپلیکیشن دسترسی‌هایی فراتر از عملکرد اصلی خود درخواست می‌کند (مانند دسترسی به پیامک‌ها، مخاطبین یا فایل‌های شخصی)، در نصب و استفاده از آن تجدید نظر کنید. دسترسی غیرضروری می‌تواند باعث سوءاستفاده از اطلاعات شخصی شما شود.",
  "در صورت دریافت پیامک یا پیامی در پیام‌رسان‌هایی مانند تلگرام یا واتس‌اپ که حاوی درخواست واریز وجه از طرف دوستان یا آشنایان است، پیش از هرگونه اقدام، حتما با شماره‌ای که از قبل در اختیار دارید تماس بگیرید و از صحت هویت فرستنده و واقعی بودن درخواست اطمینان حاصل کنید. کلاهبرداران ممکن است با هک کردن حساب کاربری دوستان یا آشنایان شما، اقدام به ارسال این نوع درخواست‌ها کنند.",
  "هرگز لینک‌های موجود در پیام‌های ارسالی از سوی افراد ناشناس را باز نکنید. مجرمان سایبری با ارسال این لینک‌ها، قربانیان را به صفحات جعلی هدایت می‌کنند که ممکن است منجر به سرقت اطلاعات بانکی و خالی شدن حساب‌هایشان شود.",
  "در معاملات آنلاین، به ویژه در فروش کالا از طریق سایت‌هایی مانند دیوار یا شیپور، مراقب رسیدهای جعلی باشید. کلاهبرداران ممکن است با استفاده از اپلیکیشن‌ها یا نرم‌افزارهای رسیدسازی، یک رسید واریز بانکی تقلبی برای شما ارسال کنند تا وانمود کنند مبلغ را پرداخت کرده‌اند. حتما پیش از تحویل کالا، موجودی حساب بانکی خود را شخصا بررسی کنید و تنها در صورت واریز واقعی وجه، کالا را تحویل دهید. اعتماد به عکس یا پیامک جعلی رسید می‌تواند منجر به از دست رفتن مال شما شود.",
  "فریب تبلیغات شبکه‌های اجتماعی در مورد برنامه‌ها یا طرح‌های سرمایه‌گذاری با وعده سودهای سریع و بالا را نخورید. کلاهبرداران معمولا این تبلیغات را با ظاهر جذاب برای جلب توجه شما منتشر می‌کنند.",
  "به لینک‌های جعلی که تنها با تغییرات کوچک در آدرس‌های معتبر ساخته می‌شوند، مانند تغییر آدرس‌هایی نظیر shaparak.ir به shaprak.ir یا موارد مشابه، توجه کنید. این لینک‌ها شما را به سایت‌های فیشینگ هدایت می‌کنند که هدف آنها سرقت اطلاعات بانکی یا شخصی شماست. پیش از وارد کردن هرگونه اطلاعات، دقت کنید که آدرس دقیق و معتبر باشد.",
  "سرویس‌های معتبر هرگز از طریق ایمیل یا تماس تلفنی از شما درخواست اطلاعات شخصی مانند شماره کارت بانکی یا رمز عبور نمی‌کنند. در صورت دریافت چنین درخواست‌هایی، آن را نادیده بگیرید.",
  "لینک‌های کوتاه‌شده در پیامک‌ها یا ایمیل‌ها را با دقت بیشتری بررسی کنید. این لینک‌ها ممکن است شما را به آدرس‌های دیگری هدایت می‌کنند. پس از انتقال به آدرس جدید، حتما دوباره همه جزئیات را با دقت بررسی کنید تا از امنیت آن اطمینان حاصل کنید.",
  "از دریافت نرم‌افزارهای بانکی از طریق پیام‌رسان‌ها یا دیگر راه‌های غیررسمی خودداری کنید. همیشه نرم‌افزارها را تنها از مارکت‌های معتبر و سایت‌های رسمی بانک‌ها دریافت کنید. نصب این نرم‌افزارها از منابع غیررسمی  می‌تواند به سرقت اطلاعات بانکی شما منجر شود.",
  "از استفاده از رمزهای عبور ساده و تکراری برای حساب‌های مختلف خودداری کنید. برای هر حساب، یک رمز عبور منحصر به فرد انتخاب کنید و از ترکیب حروف بزرگ و کوچک، اعداد و نمادها استفاده کنید. همچنین، استفاده از نرم‌افزارهای مدیریت رمز عبور می‌تواند کمک کننده باشد.",
  "با دوستان و خانواده خود درباره خطرات کلاهبرداری‌های اینترنتی صحبت کنید و آنها را در مورد نحوه تشخیص پیام‌های فیشینگ و روش‌های محافظت از اطلاعات‌شان آموزش دهید.",
  "در صورت مشاهده فعالیت مشکوک در هر یک از حساب‌های آنلاین خود، فورا رمز عبور آن را تغییر دهید و در صورت لزوم از خدمات پشتیبانی سایت یا بانک مربوطه کمک بگیرید.",
  "اگر از سوالات امنیتی برای بازیابی حساب‌های‌تان استفاده می‌کنید، سوالات و پاسخ‌های پیچیده و دشوارتر انتخاب کنید که به راحتی قابل حدس زدن نباشد.",
  "کلاهبرداری خالی‌فروشی به بهانه‌ی فروش آیفون و لوازم الکترونیکی با قیمت‌های پایین‌تر از بازار، یکی از روش‌های رایج کلاهبرداری آنلاین است. کلاهبرداران با تبلیغات اغواکننده، این محصولات را با قیمت‌های غیرواقعی به فروش می‌رسانند.",
  "برنامه مطمئن باش را تنها از منابع معتبر معرفی شده در سایت motmaenbash.ir نصب کنید و از دریافت برنامه از منابع غیررسمی یا لینک‌های ناشناس خودداری کنید."
]