package nu.milad.motmaenbash.consts

object AppConstants {


    // Database Constants
    const val DATABASE_NAME = "motmaenbash.db"
    const val DATABASE_VERSION = 1

    // Table names
    const val TABLE_FLAGGED_URLS = "flagged_urls"
    const val TABLE_FLAGGED_SENDERS = "flagged_senders"
    const val TABLE_FLAGGED_MESSAGES = "flagged_messages"
    const val TABLE_FLAGGED_WORDS = "flagged_words"
    const val TABLE_FLAGGED_APPS = "flagged_apps"
    const val TABLE_TIPS = "tips"
    const val TABLE_STATS = "stats"
    const val TABLE_UPDATE_HISTORY = "update_history"
    const val TABLE_ALERT_HISTORY = "alert_history"

    // Column names
    const val COLUMN_HASH = "hash"

    // Stats keys
    const val STAT_VERIFIED_GATEWAY = "verified_gateway"
    const val STAT_FLAGGED_LINK_DETECTED = "flagged_link_detected"
    const val STAT_FLAGGED_SMS_DETECTED = "flagged_sms_detected"
    const val STAT_FLAGGED_APP_DETECTED = "flagged_app_detected"

    const val STAT_TOTAL_SCANNED_LINK = "total_scanned_link"
    const val STAT_TOTAL_SCANNED_SMS = "total_scanned_sms"
    const val STAT_TOTAL_SCANNED_APP = "total_scanned_app"

    const val APP_PREFERENCES = "AppPreferences"
    const val PREF_KEY_LAST_UPDATE_TIME = "last_database_update_time"
    const val PREF_KEY_FIRST_LAUNCH = "first_launch"
    const val PREF_KEY_INTRO_SHOWN = "intro_shown"


    const val DONATE_URL = "https://milad.nu/page/donate"


    const val USER_REPORT_FORM_URL =
        "https://docs.google.com/forms/d/e/1FAIpQLSfzb1ueey6qQZdQb9tRm_Z7Mh3o8k_ZYysOv6AqTiQx39ahNg/viewform"


    // URL Endpoints
//    const val BASE_URL = "https://github.com/miladnouri/motmaenbash-data/raw/main/data/"
//    const val UPDATE_DATA_URL = BASE_URL + "data.json"
//    const val UPDATE_TIPS_URL = BASE_URL + "tips.json"
//    const val UPDATE_LINKS_URL = BASE_URL + "links.json"
//    const val UPDATE_APP_URL = BASE_URL + "version.json"

    //todo: remove on production
    const val BASE_URL = "https://api.npoint.io/"

    const val UPDATE_DATA_URL = BASE_URL + "cef8301364905d4c71d1"
    //edit: https://www.npoint.io/docs/cef8301364905d4c71d1

    const val UPDATE_TIPS_URL = BASE_URL + "89da9ddcd53d7f096462"
    //edit: https://www.npoint.io/docs/89da9ddcd53d7f096462

    const val UPDATE_LINKS_URL = BASE_URL + "ae8d88bef30be2e217c0"
    //edit: https://www.npoint.io/docs/ae8d88bef30be2e217c0

    const val UPDATE_APP_URL = BASE_URL + "3eeaf4d45a20eea6db9e"
    //edit: https://www.npoint.io/docs/3eeaf4d45a20eea6db9e

}


/////links

//[
//{
//    "title": "سرور ابری کرگدن",
//    "description": "سلام خوبی؟",
//    "link": "https://kargadan.ir",
//    "color": "#c00000"
//},
//{
//    "title": "یوتوب میلاد نوری",
//    "description": "سلام خوبی؟",
//    "link": "https://kargadan.ir",
//    "color": "#fffeee"
//},
//{
//    "title": "سرور ابری کرگدن",
//    "description": "سلام خوبی؟",
//    "link": "https://kargadan.ir",
//    "color": "#c00000",
//    "logo": "https://tookan.tech/demo1/media/illustrations/sigma/agency.png"
//},
//{
//    "title": "سرور ابری کرگدن",
//    "description": "سلام خوبی؟",
//    "link": "https://kargadan.ir",
//    "color": "#c00000",
//    "logo": "https://tookan.tech/demo1/media/illustrations/sigma/agency.png"
//},
//{
//    "title": "سرور ابری توکان",
//    "description": "سلام خوبی؟",
//    "link": "https://kargadan.ir",
//    "color": "#c00000",
//    "logo": "https://tookan.tech/demo1/media/illustrations/sigma/agency.png"
//}
//]

//tips
//[
//"با توجه به انتشار نسخه‌های جعلی همراه بانک و اینترنت بانک از سوی کلاهبردارها، اکیدا از جستجوی این خدمات در موتورهای جستجوی خودداری و از سایت اصلی بانک‌ها اقدام به دریافت برنامه‌ها یا خدمات مورد نظر نمایید.",
//"اخطار مهم: نرم‌افزارهای بانکی از راه‌های ارتباطی نظیر شبکه‌های اجتماعی، پیام‌رسان‌ها، سایت‌ها، بلوتوث، بازارها و... قابل اعتماد نیستند. لطفا از جستجو و نصب این نرم‌افزارها خودداری و فقط از وبگاه بانک اقدام به دریافت نسخه‌های اصلی نمایید.",
//"در پیام‌های ارسالی افراد ناشناس حاوی لینک‌های مشکوک باز و مشاهده نکنید. مجرمین با ارسال این لینک‌ها اقدام به هدایت قربانی به صفحات جعلی نموده که باعث سرقت اطلاعات بانکی و خالی شدن حساب آنان می‌شود.",
//"در صورت فروش خودرو و درج آگهی در سایت‌های دیوار و شیپور، مراقب تماس تلفنی و پیامک کلاهبرداران در خصوص انجام قولنامه یا تنظیم مبایعه‌نامه به بهانه بیعانه یا تسویه‌حساب باشید.",
//"پاسخ به هرگونه تماس تلفنی ناشناس و خطوط تلفن ثابت با هدف کلاهبرداری ارسال مرسوله پستی، اخذ نوبت در دادگاه یا پیامک ابلاغیه الکترونیک را متوقف و مراتب را به پلیس فتا گزارش کنید.",
//"در صورت دریافت تماس تلفنی با خطوط ناشناس و پیامک‌های حاوی هدیه مناسبتی، کلاهبرداری شرکت در قرعه‌کشی جشنواره‌ها و مسابقات رادیویی و تلویزیونی، به آن توجه نکرده و روی لینک‌ها کلیک نکنید.",
//"از نگهداری کپی مدارک بانکی در نرم‌افزارهای پیام‌رسانی و شبکه‌های اجتماعی خودداری کرده و به اشتراک‌گذاری هرگونه مدارک خود از این طریق خودداری نمایید.",
//"برنده شدن در قرعه‌کشی اپراتورهای تلفن همراه یا ارگان‌های مختلف منوط به خرید یا ارسال پیامک نمی‌باشد، در صورت دریافت تماس با این مضمون و درخواست اطلاعات کارت بانکی، موضوع را از طریق درگاه رسمی آن پیگیری نمایید.",
//"در صورت دریافت پیامک حاوی لینک واریز وجه یا اطلاعیه فوری، به آن توجه نکرده و مراتب را از طریق درگاه رسمی پیگیری نمایید.",
//"استفاده از نرم‌افزارهای دریافت رمز یکبار مصرف که از طریق پیام‌رسان‌ها و شبکه‌های اجتماعی منتشر می‌گردد ممنوع و مجرمانه است، لطفا جهت دریافت این نرم‌افزارها از طریق وبگاه رسمی بانک اقدام نمایید.",
//"در صورت خرید یا فروش کالا و درج آگهی در سایت‌های فروشگاهی، مراقب تماس تلفنی و پیامک افراد ناشناس با هدف کلاهبرداری و هدایت شما به صفحات پرداخت بانکی جعلی باشید.",
//"از دریافت نرم‌افزارهای بانکی از هرگونه راه‌های غیررسمی نظیر شبکه‌های اجتماعی و پیام‌رسان‌ها خودداری کرده و تنها از طریق سایت رسمی بانک اقدام نمایید. استفاده از این نرم‌افزارها می‌تواند موجب افشای اطلاعات بانکی شما گردد.",
//"هرگونه تماس تلفنی از سوی افراد ناشناس با هدف درخواست اطلاعات شخصی و مالی شما به بهانه اشتراک‌گذاری نرم‌افزارهای بانکی را گزارش دهید.",
//"در صورت دریافت پیام حاوی لینک و درخواست واریز وجه به حساب‌های بانکی، به هیچ عنوان از این لینک‌ها استفاده نکنید.",
//"---------------",
//"آدرس ایمیل فرستنده را بررسی کنید. به ویژه دقت کنید که آدرس ایمیل با نام فرستنده مطابقت داشته باشد.",
//"لینک‌ها را پیش از کلیک کردن بررسی کنید. موس را روی لینک ببرید تا آدرس کامل آن نمایش داده شود و مطمئن شوید که به وب‌سایت معتبر هدایت می‌شوید.",
//"مراقب ایمیل‌های اضطراری و هشدارها باشید. فیشینگ‌ها اغلب از احساسات فوری و ترس استفاده می‌کنند تا شما را به اقدام سریع وادار کنند.",
//"از مرورگرها و نرم‌افزارهای امنیتی معتبر استفاده کنید. این ابزارها می‌توانند بسیاری از تهدیدات فیشینگ را شناسایی و مسدود کنند.",
//"به گرامر و املای پیام‌ها توجه کنید. ایمیل‌های فیشینگ اغلب دارای اشتباهات گرامری و املایی هستند.",
//"درخواست‌های اطلاعات شخصی را با دقت بررسی کنید. سازمان‌های معتبر هرگز از طریق ایمیل اطلاعات شخصی شما را درخواست نمی‌کنند.",
//"به URLهای کوتاه شده مشکوک باشید. این URLها می‌توانند شما را به سایت‌های فیشینگ هدایت کنند.",
//"احراز هویت دو مرحله‌ای را فعال کنید. این ویژگی یک لایه امنیتی اضافی برای حساب‌های آنلاین شما فراهم می‌کند.",
//"از وب‌سایت‌های https استفاده کنید. وب‌سایت‌های امن با پروتکل https اطلاعات شما را رمزگذاری می‌کنند.",
//"به پیوست‌های مشکوک در ایمیل‌ها توجه کنید. این پیوست‌ها می‌توانند شامل بدافزارهایی باشند که سیستم شما را آلوده می‌کنند.",
//"مراقب پیامک‌های مشکوک باشید. این پیامک‌ها ممکن است شامل لینک‌ها یا درخواست‌های اطلاعات شخصی باشند.",
//"هرگز روی لینک‌های مشکوک در پیامک‌ها کلیک نکنید. این لینک‌ها می‌توانند شما را به سایت‌های فیشینگ هدایت کنند.",
//"از اپراتور تلفن همراه خود برای گزارش پیامک‌های فیشینگ استفاده کنید. اکثر اپراتورها راه‌هایی برای گزارش پیامک‌های مشکوک دارند.",
//"از برنامه‌های امنیتی برای شناسایی پیامک‌های فیشینگ استفاده کنید. این برنامه‌ها می‌توانند پیامک‌های مشکوک را شناسایی و مسدود کنند.",
//"اطمینان از معتبر بودن درگاه پرداخت. مطمئن شوید که درگاه پرداخت مورد استفاده شما از طرف یک سازمان معتبر و شناخته شده است.",
//"از سایت‌های معتبر خرید کنید. سایت‌های ناشناس و غیرمعتبر می‌توانند اطلاعات کارت بانکی شما را سرقت کنند.",
//"اطلاعات کارت بانکی خود را فقط در صفحات امن وارد کنید. صفحات امن با پروتکل https اطلاعات شما را رمزگذاری می‌کنند.",
//"از روش‌های پرداخت امن استفاده کنید. پرداخت‌های اینترنتی را از طریق روش‌های امن مانند کارت‌های اعتباری و خدمات پرداخت امن انجام دهید.",
//"هرگز اطلاعات شخصی را از طریق تلفن به افراد ناشناس ندهید. اطلاعات حساس خود را فقط با افراد و سازمان‌های معتبر به اشتراک بگذارید.",
//"مراقب تماس‌های مشکوک باشید. این تماس‌ها می‌توانند شامل درخواست‌های اطلاعات شخصی یا مالی باشند.",
//"از احراز هویت تماس گیرنده اطمینان حاصل کنید. در صورت شک، با شماره‌ای که خودتان دارید تماس بگیرید تا هویت تماس گیرنده را تایید کنید.",
//"تماس‌های مشکوک را به پلیس گزارش دهید. این اقدام می‌تواند به جلوگیری از کلاهبرداری‌های مشابه در آینده کمک کند.",
//"هنگام انتقال رمزارز ، قبل از تایید و نهایی شدن انتقال، حتما آدرس کیف پول (والت) مقصد را مجددا بررسی کنید. برخی بدافزارها یا افزونه‌های مرورگر ممکن است آدرس کیف پول را در کلیپ‌بورد تغییر دهند و رمزارز به والت کلاهبردارها منتقل شود. برای جلوگیری از این اتفاق، آدرس مقصد را  قبل از تأیید تراکنش، تطبیق دهید.",
//"هنگام خرید حضوری و استفاده از دستگاه کارت‌خوان، رمز کارت بانکی را حتما خودتان وارد کنید. از سپردن رمز کارت به فروشنده یا هر فرد دیگری خودداری کنید. کلاهبرداران ممکن است از طریق دستگاه‌های کپی کارت، موجودی کارت شما را سرقت کنند."
//]

//data
//{
//    "flagged_urls": [
//    {
//        "hash": "88501af31207d54def6ba5b1f1a277fafeb357361e3f999f66dacbdd6d622d20",
//        "threat_type": 1,
//        "url_match": 0,
//        "alert_level": 1
//    }
//    ],
//    "flagged_senders": [
//    "89786569e481d296668a8d782cc4f8c5ab13ea0c7b6bbdd98075393e0e3c28ed",
//    "89786569e481d296668a8d782cc4f8c5ab13ea0c7b6bbdd98075393e0e3c28ea"
//    ],
//    "flagged_messages": [
//    "b9f4354c1a5c25670d5786f59692e5f2c5d8fe0f0092bd3cc1b60f58f553ba8b",
//    "sssss"
//    ],
//    "flagged_apps": [
//    {
//        "package_name": "com.temptation.lydia",
//        "sha1": "3SuPq2dXfOVXEtmIHeun5217jfU=",
//        "apk_sha1": "N1/0yjV2ZSOgB0b2BxSXHYDkr18="
//    },
//    {
//        "package_name": "tech.tookan.ibolak"
//    }
//    ],
//    "flagged_words": [
//    "//سلام این",
//    "a8ee0065da2b0bf04a93ab33ae35b6af96a47e6edb66efb7fde547695bb7802e",
//    "//تست",
//    "3f7bad9447b80cc3c9c2c351a29a9148023dbc8861df8878540670cdb812fd55",
//    "bda1fa48345336618741fd2c4bc02809eb099c49a9b02fb5056401ab6d4dc3e6",
//    "خرید",
//    "06e54bf7afe653528d4cc74a916d27355bdf05248b920141ae515682c6c8df91",
//    "3cd98f07be62bc23bc081318c5622773e2563f37ceca1e996e46eb02cf5bbe3c",
//    "205eb84d2f37338bb91046b82e41449ad7390652fbf321be5c4b6224636e9b43",
//    "c7362666bdce29e2b767f5a3af08a4e5c68dfad69af0dd9e06f7a042a916a568",
//    "205eb84d2f37338bb91046b82e41449ad7390652fbf321be5c4b6224636e9b43",
//    "68d976ba9e81d924cc6f08a838b29971de88848f8c97454de4855d3921b224ae",
//    "e4ae8301af7e11678ea3c92786fbcfb623da9aee9b22f780023ffc02bf00658d"
//    ]
//}


//app update
//{
//    "latest_version_code": 1,
//    "latest_version_name": "Beta 1.0.0",
//    "force_update_version_code": 1,
//    "update_links": [
//    {
//        "title": "به‌روزرسانی از کانال تلگرام",
//        "link": "https://t.me/MiladNouriChannel"
//    }
//    {
//        "title": "دانلود از گوگل‌پلی",
//        "link": "https://link2.com"
//    },
//    {
//        "title": "دانلود از بازار",
//        "link": "https://link3.com"
//    }
//    ]
//}